4sem/luck-va/Shop/app/controllers/items_controller.rb

  def list
    unless params['catalogue_id'].blank?
      @items = Item.find(:all, :conditions => ['catalogue_id = ?', params['catalogue_id']])
---
SELECT * FROM "items" WHERE (catalogue_id = E'2')

  def edit
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 16)

  def edit_commit
    id = nil
    rollback = false
    ItemPeriod.transaction do
      ItemStorage.transaction do
        Item.transaction do
          i = Item.find(params[:item][:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 16)

  def show
    @item = Item.find(params[:id])
---
SELECT * FROM "items" WHERE ("items"."id" = 1)