4sem/luck-va/Shop/app/controllers/providers_controller.rb

  def edit
    @item = Provider.find(params[:id])
---
SELECT * FROM "providers" WHERE ("providers"."id" = 3)

  def edit_commit
    p = Provider.find(params['provider']['id'])
---
SELECT * FROM "providers" WHERE ("providers"."id" = 3)